## TASK 1 - EDA of the current Sakila Database

### Defining a function for sending in SQL queries our database

In [1]:
import duckdb

def query_sakila(query: str, duckdb_path = "data/sakila.duckdb"):
    with duckdb.connect(duckdb_path) as conn:
        df = conn.sql(query=query).df()

    return df

In [4]:
query_sakila("desc;")

,database,schema,name,column_names,column_types,temporary
0,sakila,staging,_dlt_loads,"[load_id, schema_name, status, inserted_at, sc...","[VARCHAR, VARCHAR, BIGINT, TIMESTAMP WITH TIME...",False
1,sakila,staging,_dlt_pipeline_state,"[version, engine_version, pipeline_name, state...","[BIGINT, BIGINT, VARCHAR, VARCHAR, TIMESTAMP W...",False
2,sakila,staging,_dlt_version,"[version, engine_version, inserted_at, schema_...","[BIGINT, BIGINT, TIMESTAMP WITH TIME ZONE, VAR...",False
3,sakila,staging,actor,"[actor_id, first_name, last_name, last_update,...","[DECIMAL(38,9), VARCHAR, VARCHAR, TIMESTAMP, V...",False
4,sakila,staging,address,"[address_id, address, address2, district, city...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, BIGINT, VA...",False
5,sakila,staging,category,"[category_id, name, last_update, _dlt_load_id,...","[BIGINT, VARCHAR, TIMESTAMP, VARCHAR, VARCHAR]",False
6,sakila,staging,city,"[city_id, city, country_id, last_update, _dlt_...","[BIGINT, VARCHAR, BIGINT, TIMESTAMP, VARCHAR, ...",False
7,sakila,staging,country,"[country_id, country, last_update, _dlt_load_i...","[BIGINT, VARCHAR, TIMESTAMP, VARCHAR, VARCHAR]",False
8,sakila,staging,customer,"[customer_id, store_id, first_name, last_name,...","[BIGINT, BIGINT, VARCHAR, VARCHAR, VARCHAR, BI...",False
9,sakila,staging,film,"[film_id, title, description, release_year, la...","[BIGINT, VARCHAR, VARCHAR, VARCHAR, BIGINT, BI...",False
10,sakila,staging,film_actor,"[actor_id, film_id, last_update, _dlt_load_id,...","[BIGINT, BIGINT, TIMESTAMP, VARCHAR, VARCHAR]",False
11,sakila,staging,film_category,"[film_id, category_id, last_update, _dlt_load_...","[BIGINT, BIGINT, TIMESTAMP, VARCHAR, VARCHAR]",False
12,sakila,staging,inventory,"[inventory_id, film_id, store_id, last_update,...","[BIGINT, BIGINT, BIGINT, TIMESTAMP, VARCHAR, V...",False
13,sakila,staging,language,"[language_id, name, last_update, _dlt_load_id,...","[BIGINT, VARCHAR, TIMESTAMP, VARCHAR, VARCHAR]",False
14,sakila,staging,payment,"[payment_id, customer_id, staff_id, rental_id,...","[BIGINT, BIGINT, BIGINT, BIGINT, DECIMAL(5,2),...",False
15,sakila,staging,rental,"[rental_id, rental_date, inventory_id, custome...","[BIGINT, TIMESTAMP, BIGINT, BIGINT, TIMESTAMP,...",False
16,sakila,staging,staff,"[staff_id, first_name, last_name, address_id, ...","[BIGINT, VARCHAR, VARCHAR, BIGINT, BLOB, VARCH...",False
17,sakila,staging,store,"[store_id, manager_staff_id, address_id, last_...","[BIGINT, BIGINT, BIGINT, TIMESTAMP, VARCHAR, V...",False

In [ ]:
query_sakila("FROM staging.film;").columns

# in the film table we can observe that we get length, title columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update',
       '_dlt_load_id', '_dlt_id'],
      dtype='object')

### a) Which movies are longer than 3 hours (180 minutes), show the title and its length?

In [ ]:
# Movies that are longer than 180 minutes are listed below. there are total of 39 movies

query_sakila("""
    SELECT
             title,
             length
    
    FROM
             staging.film
             
    WHERE length > 180
    ORDER BY length;
    
""")

                 title  length
0       LAWLESS VISION     181
1          WILD APOLLO     181
2       STAR OPERATION     181
3   RUNAWAY TENENBAUMS     181
4     ANALYZE HOOSIERS     181
5     HAUNTING PIANIST     181
6        LOVE SUICIDES     181
7      HOTEL HAPPINESS     181
8       INTRIGUE WORST     181
9        JACKET FRISCO     181
10     BAKED CLEOPATRA     182
11      SEARCHERS WAIT     182
12         SATURN NAME     182
13          REDS POCUS     182
14       RECORDS ZORRO     182
15       MONSOON CAUSE     182
16      YOUNG LANGUAGE     183
17      FRONTIER CABIN     183
18       SCALAWAG DUCK     183
19           WIFE TURN     183
20       CATCH AMISTAD     183
21      KING EVOLUTION     184
22    CRYSTAL BREAKING     184
23     SMOOCHY CONTROL     184
24      SONS INTERVIEW     184
25      SORORITY QUEEN     184
26   CONSPIRACY SPIRIT     184
27      THEORY MERMAID     184
28     MOONWALKER FOOL     184
29           HOME PITY     185
30       CHICAGO NORTH     185
31       MUSCLE BRIGHT     185
32        POND SEATTLE     185
33         GANGS PRIDE     185
34      DARN FORRESTER     185
35      CONTROL ANTHEM     185
36  SOLDIERS EVOLUTION     185
37   SWEET BROTHERHOOD     185
38        WORST BANGER     185

### b) Which movies have the word "love" in its title? Show the following columns
- title
- rating
- length
- description

In [ ]:
# Movies that have the word "love" in its title with its rating, length and description

query_sakila("""
    SELECT
             title,
             rating,
             length,
             description
    
    FROM
             staging.film
             
    WHERE title ILIKE '%love%';
""")

,title,rating,length,description
0,GRAFFITI LOVE,PG,117,A Unbelieveable Epistle of a Sumo Wrestler And...
1,IDAHO LOVE,PG-13,172,A Fast-Paced Drama of a Student And a Crocodil...
2,IDENTITY LOVER,PG-13,119,A Boring Tale of a Composer And a Mad Cow who ...
3,INDIAN LOVE,NC-17,135,A Insightful Saga of a Mad Scientist And a Mad...
4,LAWRENCE LOVE,NC-17,175,A Fanciful Yarn of a Database Administrator An...
5,LOVE SUICIDES,R,181,A Brilliant Panorama of a Hunter And a Explore...
6,LOVELY JINGLE,PG,65,A Fanciful Yarn of a Crocodile And a Forensic ...
7,LOVER TRUMAN,G,75,A Emotional Yarn of a Robot And a Boy who must...
8,LOVERBOY ATTACKS,PG-13,162,A Boring Story of a Car And a Butler who must ...
9,STRANGELOVE DESIRE,NC-17,103,A Awe-Inspiring Panorama of a Lumberjack And a...

### c) Calculate descriptive statistics on the length column, The Manager wants, shortest, average, median and longest movie length

In [ ]:
# Shortest, average, median and longest movie length

query_sakila("""
    SELECT
        MIN(length) as min_movie_length,
        ROUND(AVG(length)) as average_movie_length,
        MEDIAN(length) as median_movie_length,
        MAX(length) as max_movie_length
    FROM
             staging.film;
""")

,min_movie_length,average_movie_length,median_movie_length,max_movie_length
0,46,115.0,114.0,185

### d) The rental rate is the cost to rent a movie and the rental duration is the number of days a customer can keep the movie. The Manager wants to know the 10 most expensive movies to rent per day.

In [ ]:
# 10 most expensive movies to rent per day (in alphabetical order)
query_sakila("""
    SELECT
        title,
        rental_duration,
        rental_rate,
        rental_rate / rental_duration as daily_rental_cost
    FROM
        staging.film
    ORDER BY daily_rental_cost DESC,
             rental_rate DESC,
             title ASC;
""").head(10)

                 title  rental_duration  rental_rate  daily_rental_cost
0       ACE GOLDFINGER                3         4.99           1.663333
1      AMERICAN CIRCUS                3         4.99           1.663333
2          AUTUMN CROW                3         4.99           1.663333
3  BACKLASH UNDEFEATED                3         4.99           1.663333
4      BEAST HUNCHBACK                3         4.99           1.663333
5     BEHAVIOR RUNAWAY                3         4.99           1.663333
6      BILKO ANONYMOUS                3         4.99           1.663333
7    CARIBBEAN LIBERTY                3         4.99           1.663333
8     CASPER DRAGONFLY                3         4.99           1.663333
9    CASUALTIES ENCINO                3         4.99           1.663333

### e) Which actors have played in most movies? Show the top 10 actors with the number of movies they have played in.

In [ ]:
# creating a new df to find the top 10 actors with the number of movies they have played in

films_joined = query_sakila("""
    SELECT
        a.first_name || ' ' || a.last_name AS actor,
        f.title AS film_title,
        f.rating AS film_rating,
        c.name AS category,
        l.name AS language
    FROM staging.film f
        LEFT JOIN staging.film_actor fa ON f.film_id = fa.film_id
        LEFT JOIN staging.actor a ON a.actor_id = fa.actor_id
        LEFT JOIN staging.film_category fc ON f.film_id = fc.film_id
        LEFT JOIN staging.category c ON c.category_id = fc.category_id
        LEFT JOIN staging.language l ON l.language_id = f.language_id
    ORDER BY
        film_title
             ;
""")


films_joined.head(10)

              actor        film_title film_rating     category language
0  PENELOPE GUINESS  ACADEMY DINOSAUR          PG  Documentary  English
1      WARREN NOLTE  ACADEMY DINOSAUR          PG  Documentary  English
2       JOHNNY CAGE  ACADEMY DINOSAUR          PG  Documentary  English
3      OPRAH KILMER  ACADEMY DINOSAUR          PG  Documentary  English
4       MENA TEMPLE  ACADEMY DINOSAUR          PG  Documentary  English
5      ROCK DUKAKIS  ACADEMY DINOSAUR          PG  Documentary  English
6       SANDRA PECK  ACADEMY DINOSAUR          PG  Documentary  English
7   CHRISTIAN GABLE  ACADEMY DINOSAUR          PG  Documentary  English
8     LUCILLE TRACY  ACADEMY DINOSAUR          PG  Documentary  English
9       MARY KEITEL  ACADEMY DINOSAUR          PG  Documentary  English

In [ ]:
#query_sakila("from staging.film_actor;").columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update',
       '_dlt_load_id', '_dlt_id'],
      dtype='object')

In [ ]:
query_sakila("""


""")